---
kind: type
id: T:Autodesk.Revit.UI.Selection.ObjectType
source: html/2d0cbbba-d4ab-84b7-b081-36c14769d82c.htm
---
# Autodesk.Revit.UI.Selection.ObjectType

This enumerated type contains object types allowed to be selected during selection operations.

## Syntax (C#)
```csharp
public enum ObjectType
```